<?php
// Heading
$_['heading_title']                        = 'Playful Sparkle - Bank Transfer fee';
$_['heading_getting_started']              = 'Начало работы';
$_['heading_setup']                        = 'Настройка Bank Transfer fee';
$_['heading_faq']                          = 'Часто задаваемые вопросы';
$_['heading_contact']                      = 'Связаться с поддержкой';

// Text
$_['text_extension']                       = 'Расширения';
$_['text_success']                         = 'Успех: вы изменили настройки Bank Transfer fee!';
$_['text_edit']                            = 'Редактировать Bank Transfer fee';
$_['text_getting_started']                 = '<p><strong>Обзор:</strong> Модуль Playful Sparkle - Bank Transfer fee для OpenCart 4.x позволяет владельцам магазинов автоматически добавлять настраиваемую комиссию к заказам, завершенным с использованием метода оплаты "Банковский перевод". Это помогает компенсировать транзакционные или процессинговые издержки, обеспечивая гибкость и контроль над итоговой суммой заказа.</p><p><strong>Требования:</strong> OpenCart 4.x+, PHP 7.4+ или выше, а также включенный метод оплаты "Банковский перевод" в настройках магазина.</p>';
$_['text_setup']                           = '<p>Для настройки введите желаемую сумму комиссии, которая будет добавлена при оформлении заказа, выберите соответствующий класс налога и включите расширение. После настройки комиссия автоматически включается, когда клиент выбирает "Банковский перевод" на этапе оформления заказа.</p>';
$_['text_faq']                             = '<details><summary>Можно ли применять разные комиссии для других методов оплаты?</summary>Нет, это расширение добавляет комиссию только при выборе метода оплаты "Банковский перевод".</details><details><summary>Будет ли комиссия отображаться отдельно в итогах заказа?</summary>Да, комиссия отображается отдельной строкой в итоговом расчете при оформлении заказа.</details>';
$_['text_contact']                         = '<p>Для получения дополнительной помощи, пожалуйста, свяжитесь с нашей службой поддержки:</p><ul><li><strong>Контакт:</strong> <a href="mailto:%s">%s</a></li><li><strong>Документация:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Руководство пользователя</a></li></ul>';

// Tab
$_['tab_general']                          = 'Общие';
$_['tab_help_and_support']                 = 'Помощь и поддержка';

// Entry
$_['entry_fee']                            = 'Комиссия';
$_['entry_tax_class']                      = 'Класс налога';
$_['entry_status']                         = 'Статус';
$_['entry_sort_order']                     = 'Порядок сортировки';

// Error
$_['error_total_ps_bank_transfer_fee_fee'] = 'Комиссия не может быть пустой, равной или меньше нуля';

// Error
$_['error_permission']                     = 'Внимание: у вас нет прав для изменения Bank Transfer fee!';
